МПР/src/InformationRegisters/СебестоимостьНоменклатуры/СебестоимостьНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СебестоимостьНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МПР/src/InformationRegisters/ds_КатегорииНоменклатурыПлан/ds_КатегорииНоменклатурыПлан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ds_КатегорииНоменклатурыПлан</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.ds_КатегорииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МПР/src/Documents/ОприходованиеТоваров/ОприходованиеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОприходованиеТоваров</name>
  <basedOn>Document.ПриказНаПроведениеИнвентаризацииТоваров</basedOn>
  <basedOn>Document.ОрдерНаОтражениеИзлишковТоваров</basedOn>
  <basedOn>Document.ОрдерНаОтражениеРезультатовПересчетовТоваров</basedOn>
  <basedOn>Document.АктОРасхожденияхПриПриемкеТоваров</basedOn>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</registerRecords>
  <registerRecords>InformationRegister.ДвиженияСерийныхНомеров</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <attributes>
    <name>АналитикаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.АналитикаХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОрдерНаОтражениеРезультатовПересчетовТоваров</types>
      <types>DocumentRef.АктПостановкиНаБалансЕГАИС</types>
      <types>DocumentRef.АктОРасхожденияхПриПриемкеТоваров</types>
      <types>DocumentRef.ПриказНаПроведениеИнвентаризацииТоваров</types>
      <types>DocumentRef.ОстаткиЕГАИС</types>
      <types>DocumentRef.ОрдерНаОтражениеИзлишковТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ds_ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ds_ОтчетОРозничныхПродажах</name>
    <type>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СерийныеНомера</name>
    <comment>Номера подарочных сертификатов</comment>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСерийныхНомеров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСерийныхНомеров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <type>
        <types>CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МПР/src/Documents/УстановкаСебестоимости/УстановкаСебестоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСебестоимости</name>
  <basedOn>Document.ОприходованиеТоваров</basedOn>
  <registerRecords>InformationRegister.СебестоимостьНоменклатуры</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятИзУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МПР/src/Catalogs/ds_КатегорииНоменклатуры/ds_КатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ds_КатегорииНоменклатуры</name>
  <attributes>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКатегории</name>
    <type>
      <types>CatalogRef.ds_ВидыКатегорийНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>GUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

МПР/src/CommonModules/ds_ПодпискиНаСобытия/Module.bsl
Процедура НоменклатураПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Ошибки = Неопределено;
		
	ЕстьПолныеПрава = Пользователи.РолиДоступны("ПолныеПрава");
		
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено И Не ЕстьПолныеПрава Тогда
		ТекстОшибки = НСтр("ru = 'Создание/изменение номенклатуры доступно только в центральной базе.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "", ТекстОшибки);
	КонецЕсли;
		
	КодДо = СокрЛП(Источник.Код);
	Если СтрДлина(КодДо) = 7 И Сред(КодДо, 4, 1) = "-" И Не ЕстьПолныеПрава Тогда 
		ТекстОшибки = НСтр("ru = 'Создание номенклатуры с кодом формата XXX-XXX запрещено.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "", ТекстОшибки);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Источник.ds_УИД) И Не ЕстьПолныеПрава Тогда 
		ТекстОшибки = НСтр("ru = 'Редактирование номенклатуры ГЦ запрещено.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "", ТекстОшибки);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоНовый() И ПустаяСтрока(Источник.ds_GUID) И ПустаяСтрока(Источник.ds_УИД) Тогда
		GUID = Новый УникальныйИдентификатор;
		Источник.УстановитьСсылкуНового(Справочники.Номенклатура.ПолучитьСсылку(GUID));
		Источник.ds_GUID = Строка(GUID);
	КонецЕсли;
	
	Если ПустаяСтрока(Источник.ds_GUID) Тогда 
		Источник.ds_GUID = Строка(Источник.Ссылка.УникальныйИдентификатор());
	КонецЕсли;		
	
КонецПроцедуры

Процедура НСИПередЗаписью(Источник, Отказ) Экспорт

	Если Не Пользователи.РолиДоступны("ПолныеПрава") Тогда
		ОбщегоНазначения.СообщитьПользователю("Нарушение прав доступа!",,,, Отказ);	
	КонецЕсли;	

КонецПроцедуры

Процедура КонтрагентыПередЗаписью(Источник, Отказ) Экспорт

	Если Источник.Ссылка = Константы.КонтрагентРозничныйПокупатель.Получить() 
		И Не Пользователи.РолиДоступны("ПолныеПрава") Тогда
		ОбщегоНазначения.СообщитьПользователю("Нарушение прав доступа!",,,, Отказ);	
	КонецЕсли;	

КонецПроцедуры

Процедура НоменклатураПриКопировании(Источник, ОбъектКопирования) Экспорт

	Источник.ds_УИД = "";
	Источник.ds_GUID = "";

КонецПроцедуры

Процедура ОприходованиеТоваровОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	Если ПланыОбмена.ds_ОбменСОфисом.ЭтотУзел().ЭтоГлавныйУзел Тогда
		Возврат;
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОприходованиеТоваров.Ссылка КАК Ссылка,
	|	ОприходованиеТоваров.Дата КАК Дата,
	|	ОприходованиеТоваров.Магазин КАК Магазин,
	|	ОприходованиеТоваров.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
	|ГДЕ
	|	ОприходованиеТоваров.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	ВыборкаШапка.Следующий();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Цена КАК Цена
	|ИЗ
	|	Документ.ОприходованиеТоваров.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьНоменклатуры.СрезПоследних(
	|				&Дата,
	|				Магазин = &Магазин
	|					И Номенклатура В (&Номенклатура)) КАК СебестоимостьНоменклатурыСрезПоследних
	|		ПО Товары.Номенклатура = СебестоимостьНоменклатурыСрезПоследних.Номенклатура
	|ГДЕ
	|	СебестоимостьНоменклатурыСрезПоследних.Номенклатура ЕСТЬ NULL
	|	И Товары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ВыборкаШапка.Ссылка);
	Запрос.УстановитьПараметр("Номенклатура", Источник.Товары.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Магазин", ВыборкаШапка.Магазин);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ВыборкаШапка.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Док = Документы.УстановкаСебестоимости.СоздатьДокумент();
		Док.Дата = НачалоДня(ВыборкаШапка.Дата);
		Док.ДокументОснование = ВыборкаШапка.Ссылка;
		Док.Магазин = ВыборкаШапка.Магазин;
		Док.Ответственный = ВыборкаШапка.Ответственный;
		
		ТЗ = РезультатЗапроса.Выгрузить();
		Для Каждого Стр Из ТЗ Цикл 
			НовСтр = Док.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;	
		
		Док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПоступлениеТоваровОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	Если ПланыОбмена.ds_ОбменСОфисом.ЭтотУзел().ЭтоГлавныйУзел Тогда
		Возврат;
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ds_КатегорииНоменклатурыПланСрезПоследних.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.ds_КатегорииНоменклатурыПлан.СрезПоследних(
	|			&Дата,
	|			Магазин = &Магазин
	|				И Номенклатура В (&Номенклатура)) КАК ds_КатегорииНоменклатурыПланСрезПоследних
	|ГДЕ
	|	(ds_КатегорииНоменклатурыПланСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ds_КатегорииНоменклатурыПланСрезПоследних.ДатаОкончания >= &Дата)
	|	И ds_КатегорииНоменклатурыПланСрезПоследних.КатегорияНоменклатуры.ВидКатегории.СнимаетсяПоступлением";
	Запрос.УстановитьПараметр("Номенклатура", Источник.Товары.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Магазин", Источник.Магазин);
	Запрос.УстановитьПараметр("Дата", НачалоДня(Источник.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		ТаблицаПоУцененнымТоварам = РезультатЗапроса.Выгрузить();
		
		НаборЗаписей = РегистрыСведений.ds_КатегорииНоменклатурыПлан.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Регистратор.Установить(Источник.Ссылка);
		НаборЗаписей.Прочитать();
		
		Категория = Справочники.ds_КатегорииНоменклатуры.ПустаяСсылка();
		
		Для Каждого Стр Из ТаблицаПоУцененнымТоварам Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Регистратор = Источник.Ссылка;
			НоваяЗапись.Период = НачалоДня(Источник.Дата);
			НоваяЗапись.Магазин = Источник.Магазин;
			НоваяЗапись.КатегорияНоменклатуры = Категория;
			НоваяЗапись.Номенклатура = Стр.Номенклатура;
			НоваяЗапись.Цена = 0;
			НоваяЗапись.ДатаОкончания = Дата(1, 1, 1);
		КонецЦикла;
		
		НаборЗаписей.Записать();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ШтрихкодыПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Ошибки = Неопределено;
		
	ЕстьПолныеПрава = Пользователи.РолиДоступны("ПолныеПрава");
		
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено И Не ЕстьПолныеПрава 
		И ТипЗнч(Источник.Отбор.Владелец.Значение) = Тип("СправочникСсылка.Номенклатура") Тогда
		ТекстОшибки = НСтр("ru = 'Создание/изменение штрихкодов номенклатуры доступно только в центральной базе.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "", ТекстОшибки);
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);

КонецПроцедуры
